# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

a = int(input('Введите трехзначное число: '))
a1 = a%10
a = a//10
a2 = a%10
a3 = a//10
sum = a1 + a2 + a3
prod = a1 * a2 * a3
print(f'Сумма: {sum =}')
print(f'Произведение: {prod =}')